Revit 2024 API
Generic.GenericDiffuse Property
 The property labeled "Color/Image" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GenericDiffuse { get; }
Visual Basic
Public Shared ReadOnly Property GenericDiffuse As String
	Get
Visual C++
public:
static property String^ GenericDiffuse {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace